app/Controllers/CartController.php

    public function cart()
    {
        $cartItems = session('cart', []);

        // Ambil data meja dari model (asumsikan MejaModel sebagai model untuk data meja)
        $mejaModel = new MejaModel();
        $meja = $mejaModel->findAll();
---
SELECT *
FROM `meja`