app/Controllers/Home.php

    public function index()
    {
        $data = [];

        // Mengambil daftar produk dari database
        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `product`