app/Controllers/MenuController.php

    public function item()
    {
        $data = [];

        // Mengambil daftar produk dari database
        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `product`

    public function addToCart($productId)
    {
        // Dapatkan data produk berdasarkan ID dari database
        $productModel = new ProductModel();
        $product = $productModel->find($productId);
---
SELECT *
FROM `product`
WHERE `product`.`id` = '2'