app/Models/OrderModel.php

INSERT INTO `order` (`menu_name`, `quantity`, `total_price`, `customer_name`, `table_number`) VALUES ('Mie Goreng Telur', 1, 10000, 'asdda', '2')
---
    public function insertOrderDetail($data)
    {
        return $this->insert($data);